/* jshint esversion: 6 */

/*
  Создайте класс Popup
  Создайте класс Popup, который отвечает за открытие и закрытие попапа.
  Этот класс:
  - принимает в конструктор единственный параметр — селектор попапа.
  - содержит публичные методы open и close, которые отвечают за открытие и закрытие попапа.
  - содержит приватный метод _handleEscClose, который содержит логику закрытия попапа клавишей Esc.
  - содержит публичный метод setEventListeners, который добавляет слушатель клика иконке закрытия попапа.
    Модальное окно также закрывается при клике на затемнённую область вокруг формы.
*/

export default class Popup {
  constructor(selectorPopup){

  }

  _hendleEscClose(){

  }

  setEventListeners(){

  }

  open(){

  }

  close(){

  }
}
